codeoverflow/app/controllers/answers_controller.rb

INSERT INTO "answers" ("body", "user_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "I am the last answer on CodeOverFlow"], ["user_id", 2], ["question_id", 1], ["created_at", "2020-09-25 16:09:31.342537"], ["updated_at", "2020-09-25 16:09:31.342537"]]
---
    def create
        @answer = Answer.create(answer_params)

UPDATE "answers" SET "body" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["body", "I am the first English answer on CodeOverFlow"], ["updated_at", "2020-09-25 16:04:16.054975"], ["id", 1]]
---
    def update
        @answer.update(answer_params)

DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 5]]
---
    def destroy
        @answer.destroy

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_answer
        @answer = Answer.find_by(id: params[:id])