codeoverflow/app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test3"], ["LIMIT", 1]]
---
    def create
        # byebug
        user = User.find_by(username: params[:user][:username])