codeoverflow/app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "body", "tag", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test question"], ["body", "Testing 101"], ["tag", "js"], ["user_id", 15], ["created_at", "2020-09-30 13:30:27.951543"], ["updated_at", "2020-09-30 13:30:27.951543"]]
---
    def create
        # byebug
        @question = Question.create(title: params[:question][:title], body: params[:question][:body], tag: params[:question][:tag], user_id: @user.id)

UPDATE "questions" SET "title" = $1, "tag" = $2, "updated_at" = $3 WHERE "questions"."id" = $4  [["title", "What is the difference between state and props in react components?"], ["tag", "react"], ["updated_at", "2020-09-30 13:43:01.462361"], ["id", 21]]
---
    def update
        @question.update(question_params)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
---
    def find_question
        @question = Question.find_by(id: params[:id])