codeoverflow/app/controllers/users_controller.rb

    def index
        @users = User.all
---
SELECT "users".* FROM "users" WHERE (1) LIMIT ?  [["LIMIT", 1]]

    def create
        user = User.new(user_params)
        user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "image", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "kristi@mclaughlin.info"], ["updated_at", "2020-09-25 15:49:51.092866"], ["id", 1]]

    def find_user
        @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]